app/controllers/feature_flags_controller.rb

  def index
    @flags = FeatureFlag.all.order('created_at DESC')
---
SELECT "feature_flags".* FROM "feature_flags" ORDER BY created_at DESC

  def create
    @flag = FeatureFlag.create(flag_params)
---
INSERT INTO "feature_flags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "a"], ["created_at", "2018-03-10 06:36:35.528365"], ["updated_at", "2018-03-10 06:36:35.528365"]]

  def show
    flag = FeatureFlag.find_by(name: params[:name])
---
SELECT  "feature_flags".* FROM "feature_flags" WHERE "feature_flags"."name" = ? LIMIT ?  [["name", "aa"], ["LIMIT", 1]]

  def edit
    @flag = FeatureFlag.find(params[:id])
---
SELECT  "feature_flags".* FROM "feature_flags" WHERE "feature_flags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
  	@flag = FeatureFlag.find(params[:id])
  	@flag.update(flag_params)
---
SELECT  "feature_flags".* FROM "feature_flags" WHERE "feature_flags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "feature_flags" SET "name" = ?, "updated_at" = ? WHERE "feature_flags"."id" = ?  [["name", "app asmi"], ["updated_at", "2018-03-10 03:35:13.850194"], ["id", 1]]

  def destroy
  	@flag = FeatureFlag.find(params[:id])
  	@flag.destroy
---
SELECT  "feature_flags".* FROM "feature_flags" WHERE "feature_flags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "feature_flags" WHERE "feature_flags"."id" = ?  [["id", 1]]